from itertools import permutations
def f(x, y, z, w):
 return ((x <= y) or (z == x)) and (w <= z)
# описываем наборы из фрагмента таблицы истинности
table = [(0, 0, 1, 1), (0, 0, 1, 0), (0, 1, 1, 1)]
# соответствующие строкам выше значения функции
# (порядок такой же, как в table)
res = [1, 0, 0]
# перебираем все перестановки имен переменных
for p in permutations('xyzw'):
 # список для хранения значений функций для всех строк table
    resP = []
 # перебираем все строки
    for row in table:
 # формируем пары (имя переменной, значение)
 # для ('x', 'z', 'w', 'y') и (0, 0, 1, 0) получится
 # (('x', 0), ('z', 0), ('w', 1), ('y', 0))
        pairs = zip(p, row)
        print(dict(pairs))
        break
    break
#  # собираем из полученных пар словарь
#  # для (('x', 0), ('z', 0), ('w', 1), ('y', 0)) получится
#  # {'x': 0, 'z': 0, 'w': 1, 'y': 0}
#         d_pars = dict(pairs)
#  # передаем ключ-значения в функцию, как значения аргументов
#  # для {'x': 0, 'z': 0, 'w': 1, 'y': 0} получится
#  # f(x=0, z=0, w=1, y=0)
#         r = f(**d_pars)
#  # добавляем значение в итоговый список
#         resP.append(r)
#  # если список результатов для перестановки и таблицы равен res
#  # значит найдена нужная перестановка
 
# if resP == res:
#     print(*p, sep ='')
